from pyecharts import options as opts
from pyecharts.charts import Line, Pie, Grid, Page, Timeline

import json
import utils

import dao
M, Z, D = dao.get()

t = ["国外资产", "外汇", "货币黄金", "其他国外资产", "对政府债权", "中央政府", "对其他存款性公司债权", "对其他金融性公司债权", "对非金融性部门债权", "其他资产", "总资产", "储备货币", "货币发行", "金融性公司存款", "其他存款性公司存款", "其他金融性公司存款", "非金融机构存款", "不计入储备货币的金融性公司存款", "发行债券", "国外负债", "政府存款", "自有资金", "其他负债", "总负债"]


t3 = ["国外资产", "储备资产", "对政府债权", "对中央银行债权", "对其他存款性公司债权", "对其他金融机构债权", "对非金融机构债权", "对其他居民部门债权", "其他资产"]
t4 = ["对非金融机构及住户负债", "对中央银行负债", "对其他存款性公司负债", "对其他金融性公司负债", "国外负债", "债券发行", "实收资本", "其他负债"]


page = Page()
page.add(
    utils.genPies(M, [
                        dao.subset(Z, {"货币当局资产负债表": [
                            # "国外资产", 
                            "外汇", "货币黄金", "其他国外资产", 
                            "对政府债权", # "中央政府", 
                            "对其他存款性公司债权", "对其他金融性公司债权", "对非金融性部门债权", 
                            "其他资产", 
                            # "总资产",
                        ]}),
                        dao.subset(Z, {"货币当局资产负债表": [
                            # "储备货币", 
                            "货币发行", 
                            # "金融性公司存款", 
                            "其他存款性公司存款", "其他金融性公司存款", "非金融机构存款", 
                            "不计入储备货币的金融性公司存款", "发行债券", "国外负债", 
                            "政府存款", "自有资金", "其他负债", 
                            # "总负债",
                        ]}),
                   ], "货币当局资产负债表"),
    utils.genLines(M, [
                        dao.subset(Z, {"货币当局资产负债表": [
                            "国外资产", 
                            "外汇", "货币黄金", "其他国外资产", 
                            "对政府债权", # "中央政府", 
                            "对其他存款性公司债权", "对其他金融性公司债权", "对非金融性部门债权", 
                            "其他资产", 
                            "总资产",
                        ]}),
                        dao.subset(Z, {"货币当局资产负债表": [
                            "储备货币", 
                            "货币发行", 
                            # "金融性公司存款", 
                            "其他存款性公司存款", "其他金融性公司存款", "非金融机构存款", 
                            "不计入储备货币的金融性公司存款", "发行债券", "国外负债", 
                            "政府存款", "自有资金", "其他负债", 
                            "总负债",
                        ]}),
                   ], "货币当局资产负债表"),
    utils.genPies(M, [
                        dao.subset(Z, {"其他存款性公司资产负债表": [
                            '国外资产', 
                            # '储备资产', 
                            '准备金存款', '库存现金', 
                            '对政府债权', # '对中央政府债权', 
                            '对中央银行债权', 
                            '对其他存款性公司债权', 
                            '对其他金融机构债权', 
                            '对非金融机构债权', 
                            '对其他居民部门债权', 
                            '其他资产', 
                            # '总资产',
                        ]}),
                        dao.subset(Z, {"其他存款性公司资产负债表": [
                            # '对非金融机构及住户负债', 
                            # '纳入广义货币的存款', 
                            '单位活期存款', 
                            '单位定期存款', 
                            '个人存款', 
                            '不纳入广义货币的存款', 
                            # '可转让存款', 
                            # '其他存款', 
                            '其他负债存款', 
                            '对中央银行负债', 
                            '对其他存款性公司负债', 
                            '对其他金融性公司负债', 
                            '计入广义货币的存款', 
                            '国外负债', 
                            '债券发行', 
                            '实收资本', 
                            '其他负债', 
                        ]}),
                   ], "其他存款性公司资产负债表"),
    utils.genLines(M, [
                        dao.subset(Z, {"其他存款性公司资产负债表": [
                            '国外资产', 
                            '储备资产', '准备金存款', '库存现金', 
                            '对政府债权', # '对中央政府债权', 
                            '对中央银行债权', 
                            '对其他存款性公司债权', 
                            '对其他金融机构债权', 
                            '对非金融机构债权', 
                            '对其他居民部门债权', 
                            '其他资产', 
                            '总资产'
                        ]}),
                        dao.subset(Z, {"其他存款性公司资产负债表": [
                            '对非金融机构及住户负债', '纳入广义货币的存款', '单位活期存款', '单位定期存款', '个人存款', '不纳入广义货币的存款', '可转让存款', '其他存款', '其他负债存款', 
                            '对中央银行负债', '对其他存款性公司负债', '对其他金融性公司负债', 
                            '计入广义货币的存款', 
                            '国外负债', '债券发行', '实收资本', 
                            '其他负债', 
                            '总负债'
                        ]}),
                   ], "其他存款性公司资产负债表"),
    utils.genLines(M, [
                        dao.subset(Z, {"金融机构人民币信贷收支表": [
                            '各项存款', 
                            # '境内存款', 
                            '住户存款', '住户活期存款', '住户定期及其他存款', 
                            '非金融企业存款', '非金融企业活期存款', '非金融企业定期及其他存款', 
                            '机关团体存款', '财政性存款', '其他存款',
                            '非银行业金融机构存款', 
                            '境外存款', 
                            '金融债券', '流通中货币', '对国际金融机构负债', '其他', 
                            '资金来源总计', 
                        ]}),
                        dao.subset(Z, {"金融机构人民币信贷收支表": [
                            '各项贷款', 
                            # '境内贷款', 
                            '住户贷款', '住户短期贷款', '住户短期消费贷款', '住户短期经营贷款', '住户中长期贷款', '住户中长期消费贷款', '住户中长期经营贷款', 
                            '企事业单位贷款', '企事业单位短期贷款', '企事业单位中长期贷款', '企事业单位其他贷款',
                            '非银行业金融机构贷款', 
                            '境外贷款', '债券投资', '股权及其他投资', '黄金占款', '中央银行外汇占款', '在国际金融机构资产', 
                            '资金运用总计',
                        ]}),
                   ], "金融机构人民币信贷收支表"),
    utils.genPies(M, [
                        dao.subset(Z, {"金融机构人民币信贷收支表": [
                            '住户存款', 
                            # '住户活期存款', 
                            # '住户定期及其他存款', 
                            '非金融企业存款', 
                            # '非金融企业活期存款', 
                            # '非金融企业定期及其他存款', 
                            '机关团体存款', 
                            '财政性存款', 
                            '非银行业金融机构存款', 
                            '其他存款',
                            '境外存款'
                        ]}),
                        dao.subset(Z, {"金融机构人民币信贷收支表": [
                            '住户贷款', 
                            # '住户短期贷款', '住户短期消费贷款', '住户短期经营贷款', '住户中长期贷款', '住户中长期消费贷款', '住户中长期经营贷款', 
                            '企事业单位贷款', 
                            # '企事业单位短期贷款', '企事业单位中长期贷款', '企事业单位其他贷款', 
                            '非银行业金融机构贷款', 
                            '境外贷款'
                        ]}),
                   ], "金融机构人民币信贷收支表"),
    utils.genPies(M, [
                        dao.subset(Z, {"金融机构人民币信贷收支表": [
                            '住户活期存款', 
                            '住户定期及其他存款', 
                        ]}),
                        dao.subset(Z, {"金融机构人民币信贷收支表": [
                            '非金融企业活期存款', 
                            '非金融企业定期及其他存款', 
                        ]}),
                        dao.subset(Z, {"金融机构人民币信贷收支表": [
                            '机关团体存款', 
                            '财政性存款', 
                        ]}),
                        dao.subset(Z, {"金融机构人民币信贷收支表": [
                            '境内存款', 
                            '境外存款', 
                        ]}),
                   ], "金融机构人民币信贷收支表"),
)
page.render("a.html")

k1 = ['月份', '各项存款', '境内存款', '住户存款', '住户活期存款', '住户定期及其他存款', '非金融企业存款', '非金融企业活期存款', '非金融企业定期及其他存款', '机关团体存款', '财政性存款', '非银行业金融机构存款', '境外存款', '金融债券', '流通中货币', '对国际金融机构负债', '其他', '资金来源总计', '各项贷款', '境内贷款', '住户贷款', '住户短期贷款', '住户短期消费贷款', '住户短期经营贷款', '住户中长期贷款', '住户中长期消费贷款', '住户中长期经营贷款', '企事业单位贷款', '企事业单位短期贷款', '企事业单位中长期贷款', '企事业单位票据融资贷款', '企事业单位融资租赁贷款', '企事业单位各项垫款', '非银行业金融机构贷款', '境外贷款', '债券投资', '股权及其他投资', '黄金占款', '中央银行外汇占款', '在国际金融机构资产', '资金运用总计']
